<?php

declare(strict_types=1);

/**
 * @copyright  2020 Ad Aures
 * @license    https://www.gnu.org/licenses/agpl-3.0.en.html AGPL3
 * @link       https://castopod.org/
 */

return [
    'by_service_weekly' => 'Λήψεις επεισοδίων ανά υπηρεσία (για την προηγούμενη εβδομάδα)',
    'by_player_weekly' => 'Οι λήψεις επεισοδίων (για την προηγούμενη εβδομάδα)',
    'by_player_yearly' => 'Οι λήψεις επεισοδίων (για τo προηγούμενο έτος)',
    'by_device_weekly' => 'Λήψεις επεισοδίων ανά συσκευή (για την προηγούμενη εβδομάδα)',
    'by_os_weekly' => 'Οι λήψεις επεισοδίων ανά λειτουργικό σύστημα (για την προηγούμενη εβδομάδα)',
    'podcast_by_region' => 'Λήψεις επεισοδίων ανά περιοχή (για την προηγούμενη εβδομάδα)',
    'unique_daily_listeners' => 'Καθημερινά μοναδικοί ακροατές',
    'unique_monthly_listeners' => 'Μηνιαίοι μοναδικοί ακροατές',
    'by_browser' => 'Χρήση ιστοσελίδων από το πρόγραμμα περιήγησης (για την προηγούμενη εβδομάδα)',
    'podcast_by_day' => 'Ημερήσιες λήψεις του επισοδίου',
    'podcast_by_month' => 'Μηνιαίες λήψεις επεισοδίων',
    'episode_by_day' => 'Ημερήσιες λήψεις επισοδείου (πρώτες 60 ημέρες)',
    'episode_by_month' => 'Μηνιαίες λήψεις επεισοδίων',
    'episodes_by_day' =>
        '5 τελευταίες λήψεις επεισοδίων (κατά τις πρώτες 60 ημέρες τους)',
    'by_country_weekly' => 'Λήψεις επεισοδίων ανά χώρα (για την προηγούμενη εβδομάδα)',
    'by_country_yearly' => 'Λήψεις επεισοδίων ανά χώρα (για το προηγούμενο έτος)',
    'by_domain_weekly' => 'Επισκέψεις ιστοσελίδας ανά πηγή (για την προηγούμενη εβδομάδα)',
    'by_domain_yearly' => 'Επισκέψεις ιστοσελίδας ανά πηγή (για το προηγούμενο έτος)',
    'by_entry_page' => 'Επισκέψεις ιστοσελίδων ανά σελίδα προορισμού (για την προηγούμενη εβδομάδα)',
    'podcast_bots' => 'Bots (Crawlers)',
    'daily_listening_time' => 'Ημερήσιος αθροιστικός χρόνος ακρόασης',
    'monthly_listening_time' => 'Μηνιαίος αθροιστικός χρόνος ακρόασης',
    'by_weekday' => 'Την ημέρα της εβδομάδας (για τις τελευταίες 60 ημέρες)',
    'by_hour' => 'Κατά την ώρα της ημέρας (για τις τελευταίες 60 ημέρες)',
    'podcast_by_bandwidth' => 'Ημερήσιο χρησιμοποιούμενο bandwidth (σε MB)',
    'total_storage_by_month' => 'Μηνιαία αποθήκευση (σε MB)',
    'total_bandwidth_by_month' => 'Μηνιαίο χρησιμοποιούμενο εύρος ζώνης (σε MB)',
    'total_bandwidth_by_month_limit' => 'Limited to {totalBandwidth} per month',
];
