<?php

declare(strict_types=1);

/**
 * @copyright  2020 Ad Aures
 * @license    https://www.gnu.org/licenses/agpl-3.0.en.html AGPL3
 * @link       https://castopod.org/
 */

return [
    'persons' => 'Πρόσωπα',
    'all_persons' => 'Όλα τα πρόσωπα',
    'no_person' => 'Δεν βρέθηκε κανείς!',
    'create' => 'Δημιουργήστε ένα πρόσωπο',
    'view' => 'Προβολή προσώπου',
    'edit' => 'Επεξεργασία προσώπου',
    'delete' => 'Διαγραφή ατόμου',
    'messages' => [
        'createSuccess' => 'Το άτομο δημιουργήθηκε με επιτυχία!',
        'editSuccess' => 'Το άτομο ενημερώθηκε με επιτυχία!',
        'deleteSuccess' => 'Το άτομο έχει αφαιρεθεί!',
    ],
    'form' => [
        'avatar' => 'Είδωλο',
        'avatar_size_hint' =>
            'Avatar must be squared and at least 400px wide and tall.',
        'full_name' => 'Ονοματεπώνυμο',
        'full_name_hint' => 'Αυτό είναι το πλήρες όνομα ή το ψευδώνυμο του ατόμου.',
        'unique_name' => 'Μοναδικό όνομα',
        'unique_name_hint' => 'Χρησιμοποιείται για διευθύνσεις URL',
        'information_url' => 'Url Πληροφοριών',
        'information_url_hint' =>
            'Url σε μια σχετική πηγή πληροφοριών σχετικά με το άτομο, όπως μια αρχική σελίδα ή πλατφόρμα προφίλ τρίτων.',
        'submit_create' => 'Δημιουργία προσώπου',
        'submit_edit' => 'Αποθήκευση ατόμου',
    ],
    'podcast_form' => [
        'title' => 'Διαχείριση προσώπων',
        'add_section_title' => 'Προσθέστε άτομα σε αυτό το podcast',
        'add_section_subtitle' => 'Μπορείτε να επιλέξετε πολλά άτομα και ρόλους.',
        'persons' => 'Πρόσωπα',
        'persons_hint' =>
            'Μπορείτε να επιλέξετε ένα ή περισσότερα άτομα με τους ίδιους ρόλους. Πρέπει πρώτα να δημιουργήσετε τα πρόσωπα.',
        'roles' => 'Ρόλοι',
        'roles_hint' =>
            'Μπορείτε να επιλέξετε κανένα, έναν ή περισσότερους ρόλους για ένα άτομο.',
        'submit_add' => 'Προσθήκη ατόμου(ων)',
        'remove' => 'Διαγραφή',
    ],
    'episode_form' => [
        'title' => 'Διαχείριση προσώπων',
        'add_section_title' => 'Προσθήκη ατόμων σε αυτό το επεισόδιο',
        'add_section_subtitle' => 'Μπορείτε να επιλέξετε πολλά άτομα και ρόλους.',
        'persons' => 'Πρόσωπα',
        'persons_hint' =>
            'Μπορείτε να επιλέξετε ένα ή περισσότερα άτομα με τους ίδιους ρόλους. Πρέπει πρώτα να δημιουργήσετε τα πρόσωπα.',
        'roles' => 'Ρόλοι',
        'roles_hint' =>
            'Μπορείτε να επιλέξετε κανένα, έναν ή περισσότερους ρόλους για ένα άτομο.',
        'submit_add' => 'Προσθήκη ατόμου(ων)',
        'remove' => 'Διαγραφή',
    ],
    'credits' => 'Συντελεστές',
];
