<?php

declare(strict_types=1);

/**
 * @copyright  2022 Ad Aures
 * @license    https://www.gnu.org/licenses/agpl-3.0.en.html AGPL3
 * @link       https://castopod.org/
 */

return [
    'podcast_is_premium' => 'Подкаст містить преміум-епізоди',
    'episode_is_premium' => 'Цей подкаст містить преміум епізоди, тільки для преміум підписників',
    'unlock_episode' => 'Цей епізод призначений тільки для преміум підписників. Натисніть, щоб розблокувати його!',
    'banner_unlock' => 'Цей подкаст містить преміум епізоди, тільки для преміум підписників.',
    'banner_lock' => 'Подкаст був успішно розблокований! Насолоджуйтесь преміум епізодами!',
    'subscribe' => 'Підписатися',
    'lock' => 'Заблокувати',
    'unlock' => 'Розблокувати',
    'unlock_form' => [
        'title' => 'Преміум контент',
        'subtitle' => 'Цей подкаст містить заблоковані преміум епізоди! Ви маєте ключ для їх розблокування?',
        'token' => 'Введіть ваш ключ',
        'token_hint' => 'Якщо ви підписані на {podcastTitle}, ви можете скопіювати ключ, відправлений вам на електрону пошту та вставити його тут.',
        'submit' => 'Розблокувати всі серії!',
        'call_to_action' => 'Розблокувати всі серії з {podcastTitle}:',
        'subscribe_cta' => 'Підписатися зараз!',
    ],
    'messages' => [
        'unlockSuccess' => 'Подкаст був успішно розблокований! Насолоджуйтесь преміум епізодами!',
        'unlockBadAttempt' => 'Здається, ваш ключ не працює…',
        'lockSuccess' => 'Подкаст успішно заблокований!',
    ],
];
