<?php

declare(strict_types=1);

/**
 * @copyright  2020 Ad Aures
 * @license    https://www.gnu.org/licenses/agpl-3.0.en.html AGPL3
 * @link       https://castopod.org/
 */

return [
    'title' => 'Кастопод інсталятор',
    'manual_config' => 'Ручне налаштування',
    'manual_config_subtitle' =>
        'Створіть файл `.env` з налаштуваннями та перезавантажте сторінку, щоб продовжити встановлення.',
    'form' => [
        'instance_config' => 'Конфігурація екземпляру',
        'hostname' => 'Ім\'я хоста',
        'media_base_url' => 'URL-адреса бази даних медіа',
        'media_base_url_hint' =>
            'Якщо ви використовуєте CDN та/або зовнішній аналітичний сервіс, ви можете встановити їх тут.',
        'admin_gateway' => 'Шлюз Адміністратора',
        'admin_gateway_hint' =>
            'Шлях до сторінки аутентифікації (наприклад https://example.com/cp-admin). Встановлений за замовчуванням cp-auth, Ми рекомендуємо вам змінити його з міркувань безпеки.',
        'auth_gateway' => 'Шлюз авторизації',
        'auth_gateway_hint' =>
            'Шлях до сторінки аутентифікації (наприклад https://example.com/cp-auth). Встановлений за замовчуванням cp-auth, Ми рекомендуємо вам змінити його з міркувань безпеки.',
        'database_config' => 'Налаштування бази даних',
        'database_config_hint' =>
            'Кастопод потребує підключення до бази даних MySQL (або MariaDB) для відновлення. Якщо у вас немає такої необхідної інформації, будь ласка, зверніться до адміністратора вашого сервера.',
        'db_hostname' => 'Ім\'я хоста бази даних',
        'db_name' => 'Назва бази даних',
        'db_username' => 'Ім\'я користувача бази даних',
        'db_password' => 'Пароль бази даних',
        'db_prefix' => 'Префікс бази даних',
        'db_prefix_hint' =>
            "Залишайте префікс імен таблиць Castopod, якщо ви не знаєте що це значить.",
        'cache_config' => 'Конфігурація кешу',
        'cache_config_hint' =>
            'Виберіть бажаний обробник кешу або залиште без змін, як стандартне значення, якщо ви не знаєте, що це означає.',
        'cache_handler' => 'Обробник кешу',
        'cacheHandlerOptions' => [
            'file' => 'Файл',
            'redis' => 'Redis',
            'predis' => 'Predis',
        ],
        'next' => 'Далі',
        'submit' => 'Завершити установку',
        'create_superadmin' => 'Створіть свій обліковий запис головного адміністратора',
        'email' => 'Пошта',
        'username' => 'Ім\'я користувача',
        'password' => 'Пароль',
    ],
    'messages' => [
        'createSuperAdminSuccess' =>
            'Ваш обліковий запис головного адміністратора було успішно створено. Увійдіть, щоб почати подкасти!',
        'databaseConnectError' =>
            'Castopod не зміг під\'єднатися до вашої бази даних. Перевірте конфігурацію бази даних і повторіть спробу.',
        'writeError' =>
            "Не вдалося створити/записати файл `.env`. Ви повинні створити його вручну, перейшовши шаблон файлу `.env.example` в пакеті Castopode.",
    ],
];
